{
    "@context": "https://schema.org",
    "@type": "FAQPage",
    "mainEntity": [
    {
      "@type": "Question",
      "name": "Who can participate in LTS?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "<p>The LTS initiative is open to any organization with an interest in long-term support and maintenance for Eclipse technology. Members of the LTS working group must also be members of the Eclipse Foundation.</p><p>There are four membership levels: Guest, Participant, Premium, and, Steering Committee.</p><ul><li><strong>Guest members</strong> are organizations who have been invited by the Steering Committee of LTS WG for a 6 month Guest Membership. Typical guests are potential future full-fledged members who want to have a closer look before deciding on their strategy. Guest members are required to sign a participation agreement and they do not have voting rights in LTS WG meetings. Guest members will have the same access rights as Premium members for the duration of their membership. At the end of the 6 month trial period their access rights will be terminated.</li><li><strong>Participant members</strong> have access to the download site providing LTS binaries.</li><li><strong>Premium members</strong> have Participant level access as well as access to the LTS forge and build farm.</li><li><strong>Steering Committee members</strong> have Premium level access and also governance influence over the direction of the IWG such as budget and resource allocation.</li></ul>"
      }
    },{
      "@type": "Question",
      "name": "What is the purpose of LTS?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "<p>Long Term Support provides the infrastructure and ecosystem for the support of Eclipse in industries that require Eclipse releases to be maintained over a very long time. Industries such as aerospace, automotive, and enterprise software are expected to support their software stack for 10-50 years. Often, community-based support is not enough to meet customer expectations. The Eclipse LTS initiative allows these companies to release bug fixes and maintenance releases of previous versions of Eclipse technologies.</p>"
      }
    },{
      "@type": "Question",
      "name": "How does LTS work?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "<p>The Eclipse LTS Industry Working Group enables an ecosystem of service providers, technology providers and large enterprise consumers of Eclipse to share fixes and releases.  It also provides the IT infrastructure to fix, build, sign and deploy updates for older versions of Eclipse. The LTS infrastructure includes code repositories, bug tracking, knowledge management, and software distribution & code signing.</p>"
      }
    },{
      "@type": "Question",
      "name": "Code Lts Open Source?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "<p>The code hosted by the LTS working group remains open source, licensed under the same open source license. For example, the EPL.</p>"
      }
    }
    ]
}